[
    {
        "id": "alchemist",
        "regionId": "alchemey_house",
        "dialogue": [
            {
                "content_zh": [
                    "作为一位炼丹师，我很高兴你来找我寻求任务。如果你希望变得更强，炼丹是一条可行的路径。",
                    "我可以帮助你通过炼制药丸来提升你的修为。但在开始任务之前，我需要你提供一些炼丹所需的材料。",
                    "根据你的修为和目标，我建议你搜集一些稀有的草药和矿石。你可以在远古山脉和神秘森林中寻找它们。",
                    "请注意，这些材料在野外有一定的危险性，并且它们可能只能在特定的地方和时间出现。",
                    "一旦你收集到足够的材料，回来找我，我将指导你如何进行炼制。",
                    "记住，炼丹过程需要耐心和精确性，所以请务必按照我的指导来操作，以确保炼制出高品质的药丸。",
                    "完成这个任务后，你将获得你所期望的提升修为的机会。我期待着看到你变得更加强大。祝你好运！"
                ],
                "content_en": [
                    "As an alchemist, I am pleased that you have come to me for a quest. If you desire to become stronger, alchemy is a viable path.",
                    "I can assist you in elevating your cultivation through the refinement of pills. However, before we begin the quest, I require you to provide me with certain alchemical materials.",
                    "Based on your cultivation level and goals, I suggest you gather some rare herbs and ores. You can find them in the ancient mountains and mysterious forests. Please be aware that these materials can be dangerous to acquire in the wild, and they may only appear in specific locations and times.",
                    "Once you've collected enough materials, return to me, and I will guide you on how to perform the refinement process. Remember, alchemy requires patience and precision, so it's crucial to follow my instructions to ensure the creation of high-quality pills.",
                    "Upon completing this quest, you will have the opportunity to enhance your cultivation as desired. I look forward to witnessing your growth and inner strength. Good luck!"
                ],
                "mission": {
                    "type": "采药",
                    "name_zh": "收集药材,炼制生骨丹",
                    "name_en": "Collect medicinal herbs and refine the Bone Revitalizing Pill",
                    "condition": "",
                    "attribute": "agility",
                    "threshold": "2",
                    "succeedId": "AS",
                    "failId": "AF",
                    "awardId": "AS",
                    "punishId": "AF"
                }
            },
            {
                "content_zh": [
                    "作为一个炼丹师，我非常欣赏你上次成功完成任务并通过服用丹药变强。",
                    "然而，我必须提醒你，这次的丹药与上次不同。它蕴含着一种妖气，可能会对你的修为产生负面影响。",
                    "虽然你心性有所提升，但还需要进一步加强你的炼丹水平，才能有效地抵御妖气的侵袭。",
                    "这次的丹药属于高阶级别，需要更多的耐心和精确度来进行炼制。我强烈建议你在服用之前，先提高自己的炼丹水平，以确保你能够对抗妖气的反攻。",
                    "炼丹的过程中，一丝不慢的仔细操作非常重要。如果你需要更多的指导和帮助，我将非常乐意为你提供。",
                    "但请记住，炼丹是一门细致而艰难的技艺，不要急于求成。只有在充分了解并且具备足够的修为之后，才能安全地尝试五座殿的炼制技巧。",
                    "不要为了一时的好处而忽略了危险的后果。希望你能谨慎行事，耐心地跟随我的指导，以便安全并且有效地提高你的修为。"
                ],
                "content_en": [
                    "As an alchemist, I greatly appreciate your successful completion of the previous task and the enhancement of your strength through consuming the pill.",
                    "However, I must caution you that this time the pill contains a demonic aura, which may have adverse effects on your cultivation.",
                    "While your mental cultivation has improved, it is necessary to further strengthen your alchemy skills to effectively resist the backlash of demonic energy.",
                    "The pill you seek to refine this time is of a higher level and requires more patience and precision in the refinement process.",
                    "I strongly advise you to enhance your alchemy skills before consuming it, to ensure that you can withstand the counterattack of demonic energy.",
                    "Careful and precise operation during the alchemy process is crucial.",
                    "I am more than willing to provide you with further guidance and assistance if needed.",
                    "However, please bear in mind that alchemy is a meticulous and challenging art.",
                    "Do not rush for immediate gains and overlook the potential dangers.",
                    "Only when you have sufficient cultivation and understanding, can you safely attempt the refinement techniques of the Five Mansions.",
                    "Neglecting caution might lead to adverse consequences.",
                    "I hope you will proceed with caution, patiently follow my guidance, and safely and effectively enhance your cultivation."
                ],
                "mission": {
                    "type": "炼丹",
                    "name_zh": "炼制洗髓丹,并驱逐妖气",
                    "name_en": "Refine the Marrow Cleansing Pill and expel demonic energy",
                    "condition": "refining_pills>3",
                    "attribute": "refining_pills",
                    "threshold": "7",
                    "succeedId": "AAS",
                    "failId": "AAF",
                    "awardId": "AAS",
                    "punishId": "AAF",
                    "needSubmit":true
                }
            },
            {
                "content_zh": [
                    "我非常欣赏你的努力与天赋。",
                    "在你修炼了五府锻元诀之后，你的修为展现出惊人的进步，确实让我感到惊讶不已。",
                    "然而，关于你对更高级别丹药的需求，我必须谨慎考虑。",
                    "你提到了阴性功法的问题，这的确是一个需要解决的重要问题。",
                    "龙虎丹确实是一种能够帮助调和阴阳之力的神奇丹药。",
                    "然而，它对力量的要求相当高，如果你的力量未达到标准，服用龙虎丹后可能会引发严重的后果，导致七窍流血而亡。",
                    "为了确保你的安全和成功修炼，我强烈建议你在服用龙虎丹之前，先修炼出强大的力量。",
                    "只有拥有足够的力量，你才能更好地承受龙虎丹带来的力量冲击。",
                    "这样做可以大大提高你修炼成功的机率，保障你的安全。",
                    "因此，我建议你与其他修炼相关功法的高手进行交流，了解他们在修炼力量方面的经验和心得。",
                    "只有通过不断地修炼和增强力量，你才能够在修炼洗髓丹时大放异彩。",
                    "我的朋友，你的安全和稳定的修炼对我来说至关重要。",
                    "我会持续寻找最适合你的修炼方法，并确保你的修炼旅程是安全而稳定的。",
                    "请告诉我你的期望和目标，我会继续为你寻找最合适的功法。",
                    "无论如何，安全和稳定的进步永远是最重要的。"
                ],
                "content_en": [
                    "I greatly appreciate your efforts and talents.",
                    "After cultivating the Five Mansion Cultivation Technique, your progress has been astonishing, truly surprising me.",
                    "However, I must be cautious regarding your request for higher-level elixirs.",
                    "You mentioned the issue of Yin-based cultivation, which is indeed an important matter to address.",
                    "The Bull's Protection Art is indeed a remarkable elixir that can help balance Yin and Yang energies.",
                    "However, it demands a high level of strength.",
                    "If your strength does not meet the requirements and you consume the elixir, it could have severe consequences, possibly resulting in bleeding from the seven orifices and death.",
                    "To ensure your safety and successful cultivation, I strongly recommend that you first cultivate powerful strength before taking the Bull's Protection Art.",
                    "Only with sufficient strength can you better endure the impact of the elixir.",
                    "By doing so, you greatly increase your chances of successful cultivation and ensure your safety.",
                    "Therefore, I suggest that you engage in discussions with experts in other cultivation techniques related to strength.",
                    "Learn from their experiences and insights in cultivating strength.",
                    "Only through consistent cultivation and strengthening of your power can you truly shine in your cultivation of the Bull's Protection Art.",
                    "My friend, your safety and steady progress are of utmost importance to me.",
                    "I will continue to search for the most suitable cultivation method for you and ensure that your cultivation journey is safe and stable.",
                    "Please share with me your expectations and goals, and I will continue to search for the most appropriate technique.",
                    "Nonetheless, safety and steady progress will always be the top priorities."
                ],
                "mission": {
                    "type": "修炼",
                    "name_zh": "修炼力量,并练成龙虎丹",
                    "name_en": "Cultivate strength and refine the Dragon-Tiger Pill",
                    "condition": "strength>8",
                    "attribute": "strength",
                    "threshold": "7",
                    "succeedId": "BAS",
                    "failId": "BAF",
                    "awardId": "BAS",
                    "punishId": "BAF"
                }
            },
            {
                "content_zh": [
                    "世间万法，本自同根，炼丹如练剑，练剑也如炼丹。等你何时炼丹一途有足够的造诣，我自会把这柄“丹剑”借你一阅。否则即便给你，也与你无益。"
                ],
                "content_en": [
                    "All phenomena in the world originate from the same root. Alchemy is akin to swordsmanship, and swordsmanship is akin to alchemy. When you have achieved sufficient mastery on the path of alchemy, I will lend you this 'Dan Sword' for your perusal. Otherwise, even if I were to give it to you, it would be of no benefit."
                ],
                "mission": {
                    "type": "观摩炼丹师的剑（失败）",
                    "name_zh": "观摩炼丹师的剑（失败）",
                    "name_en": "Observe and learn from the sword of the alchemist(failed)",
                    "condition": "refining_pills<6",
                    "attribute": "",
                    "threshold": ""
                }
            },
            {
                "content_zh": [
                    "吾观你丹道、器道都小有所成，甚是欣慰，此剑就借你一观，望你融会贯通。"
                ],
                "content_en": [
                    "I see that your alchemy and swordsmithing skills have improved, and I am pleased with your progress. I will lend you this sword for your observation, hoping that you can fully comprehend its essence."
                ],
                "mission": {
                    "type": "观摩炼丹师的剑（成功）",
                    "name_zh": "观摩炼丹师的剑（成功）",
                    "name_en": "Observe and learn from the sword of the alchemist(success)",
                    "condition": "refining_pills>=6",
                    "attribute": "",
                    "threshold": ""
                }
            }
        ]
    },
    {
        "id": "bookkeeper",
        "regionId": "book_house",
        "dialogue": [
            {
                "content_zh": [
                    "作为天机阁长老和藏经阁管家，我非常乐意为你提供帮助。五府锻元诀是一种非常强大的功法，但它确实需要修为充沛、有所领悟的人才能够顺利修炼。",
                    "如果你的修为不到位，贸然修炼该功法可能会导致修为倒退，甚至受到损害。因此，在你开始修炼之前，我强烈建议你先提升自己的修为。",
                    "确保你达到一定的境界，并且具备足够的体魄和精神力量，才能够充分吸收和驾驭五府锻元诀的力量。另外，修炼五府锻元诀是一项需要耐心和精准度的过程。",
                    "只有在你专注于修炼过程，并且按照正确的方法和步骤进行时，才能够真正发挥功法的威力。如果你冒然行事或者过于急躁，可能会导致功法效果不佳，甚至走火入魔。",
                    "因此，请在修炼五府锻元诀时，保持专注和耐心。严格遵循我的指导和要求，确保每个步骤都准确无误。只有这样，你才能真正获得提升修为的机会，并且在修炼过程中确保自身的安全。",
                    "如果你对五府锻元诀的修炼有任何问题或者需要更多指导，随时来找我，我会尽力帮助你。祝你修炼之旅一帆风顺，成为更强大的修仙者！"
                ],
                "content_en": [
                    "As an Elder of the Celestial Mechanism Pavilion and the steward of the Scripture Repository, I am more than willing to assist you. ",
                    "The Five Mansions' Refinement Technique is a powerful cultivation method, but it indeed requires a sufficient cultivation level and comprehension to practice it successfully.",
                    "If your cultivation is not up to par, hastily practicing this technique may actually result in a decline in your cultivation or even harm to your spiritual foundation.",
                    "Therefore, before you embark on practicing this technique, I strongly recommend that you first enhance your cultivation.",
                    "Ensure that you reach a certain realm and possess sufficient physical and spiritual strength to fully absorb and control the power of the Five Mansions' Refinement Technique. ",
                    "Additionally, practicing the Five Mansions' Refinement Technique is a process that requires patience and precision.",
                    "Only by devoting your full focus to the cultivation process and following the correct methods and steps can you truly unleash the power of this technique.",
                    "Acting recklessly or being too impatient may lead to suboptimal results or even deviation from the righteous path. Thus, please maintain focus and patience while practicing the Five Mansions' Refinement Technique. ",
                    "Strictly adhere to my guidance and instructions to ensure every step is precise and accurate. Only in doing so can you truly seize the opportunity to enhance your cultivation and ensure your safety throughout the practice.",
                    "If you have any questions or need further guidance regarding the cultivation of the Five Mansions' Refinement Technique, feel free to approach me at any time. ",
                    "I will do my utmost to assist you. May your cultivation journey be smooth and may you become a stronger cultivator!"
                ],
                "mission": {
                    "type": "练功",
                    "name_zh": "修炼功法",
                    "name_en": "Cultivate martial arts techniques",
                    "condition": "cultivation>6",
                    "attribute": "cultivation",
                    "threshold": "9",
                    "succeedId": "BS",
                    "failId": "BF",
                    "awardId": "BS",
                    "punishId": "BF"
                }
            },
            {
                "content_zh": [
                    "作为天机阁的长老和藏经阁的管家，我专注于寻找适合他人修炼的正统功法。",
                    "然而，我遗憾地告诉你，我坚决抵制炼丹术，因为我认为它属于歪门邪道。",
                    "我注意到你曾经服用过丹药来增强自己的力量，这种行为我视为懦夫之举，缺乏真正的修行精神。",
                    "因此，我无法向你传授任何功法。",
                    "在修仙之道上，真正的实力来自内心的修炼和悟道，而不是依靠外力的辅助。",
                    "将依赖于丹药和其他外部物品来提高修为的做法，只会让你陷入迷茫和依赖。",
                    "我希望你能明白我的立场，并开始寻求更加正统和纯粹的修行方法。",
                    "只有通过坚持不懈的努力和对自身的探索，你才能真正变得强大。",
                    "如果你对此有任何质疑或需要帮助，我仍愿意提供指导和建议，但我将坚守我的原则，不会向你传授炼丹术或任何依赖外力的功法。",
                    "祝你在修为之路上找到真正的力量。"
                ],
                "content_en": [
                    "As an elder of the Heavenly Secret Pavilion and the steward of the Scripture Pavilion, my focus is on finding orthodox cultivation methods suitable for others.",
                    "However, I regret to inform you that I strongly oppose alchemy, as I consider it to be a crooked path.",
                    "I have noticed that you have previously consumed pills to enhance your own strength.",
                    "I view this as an act of cowardice, lacking in true cultivation spirit.",
                    "Therefore, I cannot impart any cultivation methods to you.",
                    "In the path of immortal cultivation, true strength comes from inner cultivation and enlightenment, rather than relying on external aids.",
                    "Relying on pills and other external items to improve one's cultivation will only lead to confusion and dependency.",
                    "I hope you can understand my stance and begin seeking more orthodox and pure cultivation methods.",
                    "It is only through persistent effort and self-exploration that you can truly become powerful.",
                    "If you have any doubts or need assistance in this matter, I am still willing to offer guidance and advice.",
                    "However, I will adhere to my principles and refrain from teaching you alchemy or any cultivation methods that rely on external aids.",
                    "I wish you find true power on your path of cultivation."
                ],
                "mission": {
                    "type": "",
                    "name_zh": "",
                    "name_en": "",
                    "succeedId": "ABF",
                    "failId": "ABF",
                    "awardId": "ABF",
                    "punishId": "ABF"
                }
            },
            {
                "content_zh": [
                    "作为天机阁长老和藏经阁管家，我的责任是确保每个修行者得到最适合他们的功法。",
                    "我很高兴看到你能成功修炼五府锻元诀，展示了你惊人的潜力。",
                    "然而，我必须强调蛮牛护体决的风险和对体质的要求。",
                    "这是一种非常强大但危险的功法，体质不符合标准的人可能会面临生命的危险。",
                    "因此，在为你推荐此功法之前，我们需要对你的身体状况进行评估。",
                    "这样可以确保你的安全和稳定。",
                    "通过与修炼相关功法的人进行交流论道，你可以获取关于蛮牛护体决的更多信息，并了解别的可能更适合你的选择。",
                    "这种交流可以帮助你更好地了解风险和需要付出的努力。",
                    "我们的目标是在确保你的安全和稳定的前提下，让你实现自己变强的愿望。",
                    "请告诉我你的期望和目标，我会努力寻找最适合你的功法。",
                    "我们希望你在修行的道路上取得稳定而持续的进步。"
                ],
                "content_en": [
                    "As an Elder of the Tianji Pavilion and the custodian of the scripture library, it is my responsibility to ensure that each cultivator receives the most suitable cultivation technique.",
                    "I am delighted to see that you have successfully cultivated the Five Mansion Cultivation Technique, showcasing your astounding potential.",
                    "However, I must emphasize the risks and physical requirements associated with the Bull's Protection Art.",
                    "It is a powerful yet dangerous technique, and those whose physique does not meet the standards may face life-threatening dangers.",
                    "Therefore, before recommending this technique to you, we need to assess your physical condition.",
                    "This is to ensure your safety and stability.",
                    "By engaging in discussions and exchanging insights with practitioners who are familiar with related techniques, you can gather more information about the Bull's Protection Art and explore other options that may be more suitable for you.",
                    "This exchange can help you gain a better understanding of the risks and efforts involved.",
                    "Our goal is to help you fulfill your desire for strength while ensuring your safety and stability.",
                    "Please share your expectations and goals so that I can diligently seek out the most suitable technique for you.",
                    "We hope to see you make steady and consistent progress on your cultivation journey."
                ],
                "mission": {
                    "type": "论道",
                    "name_zh": "与他人讨论功法",
                    "name_en": "Discuss martial arts techniques with others",
                    "condition": "physique>4",
                    "attribute": "physique",
                    "threshold": "8",
                    "succeedId": "BBS",
                    "failId": "BBF",
                    "awardId": "BBS",
                    "punishId": "BBF"
                }
            },
            {
                "content_zh": [
                    "对吾辈而言，自身修行才是立身之本。兵器、丹药只是辅助。我观你功法稀疏平常，缺整日醉心与炼器，实属歧途，此剑我无法借你，带你哪日功法精进，再来找我吧。"
                ],
                "content_en": [
                    "For us, self-cultivation is the foundation of our standing. Weapons and elixirs are merely auxiliary. I observe that your martial arts are sparse and ordinary, lacking dedication to refining your skills. It is indeed a wrong path. I cannot lend you this sword. When your martial arts improve one day, come and find me again."
                ],
                "mission": {
                    "type": "观摩藏经阁长老的剑（失败）",
                    "name_zh": "观摩藏经阁长老的剑（失败）",
                    "name_en": "Observe and learn from the sword of the bookkeeper(failed)",
                    "condition": "cultivation<6",
                    "attribute": "",
                    "threshold": ""
                }
            },
            {
                "content_zh": [
                    "你虽然整日醉心于炼器，但是修行也并没有落下，实属不易。此剑“破军”便借你一观，除此之外，阁中还有一本《百兵谱》你也一并拿去，好生专研"
                ],
                "content_en": [
                    "\nAlthough you are immersed in refining tools all day long, you have not neglected your cultivation, which is truly remarkable. I will lend you a look at this sword called \"Breaking the Army\". In addition, there is also a book called \"Hundred Weapons Catalog\" in the pavilion. You can take it along and study it carefully."
                ],
                "mission": {
                    "type": "观摩藏经阁长老的剑（成功）",
                    "name_zh": "观摩藏经阁长老的剑（成功）",
                    "name_en": "Observe and learn from the sword of the bookkeeper(success)",
                    "condition": "cultivation>=6",
                    "attribute": "",
                    "threshold": ""
                }
            }
        ]
    },
    {
        "id": "weapon_master",
        "regionId": "weapon_house",
        "dialogue": [
            {
                "content_zh": [
                    "小子，我看你骨骼惊奇，是个学炼器的好苗子，要不要和老夫学上一学。他日，百般兵器，信手拈来岂不快哉？这炼器一途，非一朝一夕之攻，你若是感兴趣，那还得从最简单的矿石知识学起。最近门派刚发现了一片新的矿脉，包含粗铁、精铁等基本矿石，和寒铁等稀有矿石，你就先去那边学习基本的挖矿、筛选、冶炼相关知识吧。"
                ],
                "content_en": [
                    "Kid, I see your extraordinary talent. You're a promising candidate for learning weapon forging. How about learning a thing or two from me? In the future, wouldn't it be delightful to effortlessly wield all sorts of weapons? The path of forging is not something achieved overnight. If you're interested, you'll have to start with the basics of mining knowledge. Recently, our sect has discovered a new vein containing basic ores like crude iron and refined iron, as well as rare ores like frigid iron. You should go there first and learn the basic knowledge of mining, screening, and smelting."
                ],
                "mission": {
                    "type": "挖矿",
                    "name_zh": "挖矿",
                    "name_en": "mining",
                    "condition": "",
                    "attribute": "",
                    "threshold": "2"
                }
            },
            {
                "content_zh": [
                    "不错不错，我看你已经基本掌握了矿石的基本知识，接下来可以开始学习炼器了。鉴于你当前的水平，我就先教你如何锻造铁剑吧。你要记住，万法不离其宗，你学会了此种炼器方法之后，可以用不同的矿石进行锻造，从而得到不同属性的武器。"
                ],
                "content_en": [
                    "Good, good. I see that you have already grasped the basic knowledge of ores. Now, you can start learning the art of crafting. Considering your current level, I will teach you how to forge an iron sword first. Remember, all methods are rooted in the same principles. Once you have learned this particular crafting method, you can use different ores to forge weapons with different attributes."
                ],
                "mission": {
                    "type": "锻造",
                    "name_zh": "锻造",
                    "name_en": "forging",
                    "condition": "refining_equipment>=2",
                    "attribute": "refining_equipment",
                    "threshold": "2"
                }
            },
            {
                "content_zh": [
                    "炼器一途，讲究千锤百炼。之前传授你的武器炼制之法，仅仅算是粗炼，还称不上一把法器。你还需要不停地对武器进行精炼。看在你小有天赋，态度也还算积极，我就传授你几种强化之法，但材料可得你自己提供"
                ],
                "content_en": [
                    "The path of refining tools emphasizes repeated tempering. The method of weapon refining I taught you earlier was merely a rough refinement, far from being considered a magical tool. You still need to continuously refine your weapon. Considering your talent and relatively positive attitude, I will teach you several methods of enhancement, but you will have to provide the materials yourself."
                ],
                "mission": {
                    "type": "強化",
                    "name_zh": "強化",
                    "name_en": "strengthen",
                    "condition": "refining_equipment>4",
                    "attribute": "refining_equipment",
                    "threshold": "4"
                }
            },
            {
                "content_zh": [
                    "师傅领进门，修行靠个人。炼器相关的基本知识你已经学习得差不多了，接下来就靠你自己摸索了。门派之中有不少人身负神兵利器，你可以借来观摩，从而提高自己对炼器的理解，等你炼器打到15之后，再来找我吧。"
                ],
                "content_en": [
                    "Master leads the way, but practice relies on the individual. You have learned the basic knowledge related to refining tools. From now on, it's up to you to explore on your own. Within the sect, there are many people who possess divine weapons. You can borrow them for observation to enhance your understanding of refining tools. Once you reach a proficiency level of 15 in refining tools, come and find me again."
                ],
                "mission": {
                    "type": "观摩",
                    "name_zh": "观摩",
                    "name_en": "observe and learn",
                    "condition": "refining_equipment>6",
                    "attribute": "refining_equipment",
                    "threshold": "6"
                }
            },
            {
                "content_zh": [
                    "最近我炼器缺一块寒铁，你若是能帮我找到，借你看一看我的“七星剑”也不是不行。寒铁需夜间去采集，且它外形与普通矿石无异，需要你又足够的炼器知识，才能从矿脉中找到。"
                ],
                "content_en": [
                    "Recently, I've been missing a piece of cold iron for my refining work. If you can help me find it, I can let you take a look at my \"Seven Star Sword.\" Cold iron can only be collected at night, and its appearance is indistinguishable from ordinary ore. You need to have sufficient knowledge of refining in order to find it within the veins."
                ],
                "mission": {
                    "type": "观摩神兵阁长老的剑",
                    "name_zh": "观摩神兵阁长老的剑",
                    "name_en": "Observe and learn from the sword of the weapon master",
                    "condition": "寒铁x1",
                    "attribute": "",
                    "threshold": ""
                }
            },
            {
                "content_zh": [
                    "为师观你在短短时间内便已在炼器一途登堂入室，深感欣慰，我门派数十年来还未有如此天赋异禀的苗子，实属不易。今日就传你斩龙剑的炼制手法，希望你能好生领悟。"
                ],
                "content_en": [
                    "As your master, I have observed that you have already made remarkable progress in the art of refining weapons in such a short period of time. I feel deeply gratified. In our sect's several decades of existence, we have yet to come across such a naturally gifted disciple like you. It is truly remarkable. Today, I will pass on to you the technique of forging the Dragon Slayer Sword, hoping that you can comprehend it well."
                ],
                "mission": {
                    "type": "斩龙剑",
                    "name_zh": "斩龙剑",
                    "name_en": "Dragon Chopping Sword",
                    "condition": "refining_equipment>=12",
                    "attribute": "",
                    "threshold": ""
                }
            }
        ]
    }
]